---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceServerExtensions.GetRevitLinkOperations
source: html/b0f35e96-beaf-cc07-d3d6-52788f63d16f.htm
---
# Autodesk.Revit.DB.ExternalResourceServerExtensions.GetRevitLinkOperations Method

Gets the specific methods supported by the external resource of Revit Links.

## Syntax (C#)
```csharp
public RevitLinkOperations GetRevitLinkOperations()
```

## Returns
The specific methods supported by the external resource of Revit Links.